{"config": [{"config": {"implementation": 0, "batch_input_shape": [null, 40, 46], "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": false, "unroll": false, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dense_2", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 46, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}